---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ThermalAsset..::..Equals Method
ThermalAsset Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Equals(Object) | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
|  | Equals(ThermalAsset) | Determines whether this thermal asset is equal to another. |

# See Also

ThermalAsset Class

ThermalAsset Members

Autodesk.Revit.DB Namespace